org/blog/20220212-symbolic-aesara.org
#+TITLE: Rewriting Aesara graphs
#+DATE: <2022-04-12 Thu>
#+PROPERTY: header-args :eval never-export

This article is a port of [[https://twitter.com/BrandonTWillard][Brandon Willard']]s [[https://pymc-devs.github.io/symbolic-pymc/symbolic-pymc-tour.html][Tour of the Symbolic PyMC library]], and is a simplified version of the [[https://aesara.readthedocs.io/en/latest/extending/graph_rewriting.html#unification-and-reification][example in Aesara's documentation]]. The text is almost a verbatim copy of the original, but mistakes are obviously mine.

In this document we will be implementing a symbolic "search-and-replace" that changes aesara graphs like =at.dot(A, x+y)= to =at.dot(A, x) + at.dot(A, y)=. In other words we will demonstrate how to implement the distributive property of the matrix multiplication so it can be applied to any aesara graph. Aesara allows one to implement rewrite rules like the distributive property---and many other sophisticated manipulation of graphs---by providing flexible, pure Python versions of core operations in symbolic computation. These operations are then combined and orchestrated through the relational programming DSL [[http://minikanren.org/][miniKanren]].

More specifically, we’ll introduce the basic unification and reification operations and explicitly show how they relate to graph manipulation and the modeling of high-level mathematical relations. Along the way, we’ll cover some of the necessary details behind Aesara graphs.

We start by creating a graph of our target expressions–i.e. =at.dot(A, x + y)= in Aesara. We need to do this in order to determine exactly what we’re searching for and–later–what to put in its place.

#+begin_src python :session :results silent :exports code
import aesara.tensor as at

A_tt = at.matrix("A")
x_tt = at.vector("x")
y_tt = at.vector("y")
z_tt = at.dot(A_tt, x_tt + y_tt)
#+end_src

We can get a text print-out of the graph using the debug print function =dprint=

#+begin_src python :session :results output :exports both
import aesara

aesara.dprint(z_tt)
#+end_src

#+RESULTS:
: dot [id A] ''
:  |A [id B]
:  |Elemwise{add,no_inplace} [id C] ''
:    |x [id D]
:    |y [id E]

The output of =dprint= shows the underlying operators (=dot=, =add=) and their arguments.

To "math/search for" combinations of Aesara operations--or, as we just saw, graphs--we use *unification*; to "replace" parts of the graph (well, produce a copy with replaced parts) we use *reificatoin*. Aesara provides support for these via *expression-tuples*.

* S-expressions

We can convert an Aesara graphs into an [[https://en.wikipedia.org/wiki/S-expression][S-expression-like]] form using [[https://github.com/pythological/etuples][etuples]].

#+begin_src python :session :results output :exports both
from etuples import etuple, etuplize
from IPython.lib.pretty import pprint

z_et = etuplize(z_tt)
pprint(z_et)
#+end_src

#+RESULTS:
#+begin_example
e(
  e(aesara.tensor.math.Dot),
  A,
  e(
    e(
      aesara.tensor.elemwise.Elemwise,
      <aesara.scalar.basic.Add at 0x7fd9c9f1a440>,
      <frozendict {}>),
    x,
    y))
#+end_example

An =etuple= is like a normal =tuple=, except that its first element is a =Callable= and the remaining elements are the =Callable='s arguments. As above, a pretty-printed =etuple= looks like a =tuple= prefixed by an =e=.

By working with =etuples= we can use *arbitrary Python functions* in conjunction with Aesara graphs and logic variable arguments. Basically, and =etuple= can be manipulated until all of its constituent logic variables are replaced with valid arguments to the function/operators. At that point the etuple can be evaluated.

For instance we can create an =etuple= that uses the function =at.add= with a logic variable argument.

#+begin_src python :session :results output :exports code
from unification import var

x_lv, y_lv = var('x'), var('y')
add_pattern = etuple(etuplize(at.add), x_lv, y_lv)
#+end_src

It wouldn't normally be possible to call the =at.add= function with these argument types, as demonstrated in this example:

#+begin_src python :session :results output :exports both
try:
    at.add(x_lv, 1)
except NotImplementedError as e:
    print(str(e))
#+end_src

#+RESULTS:
: Cannot convert ~x to a tensor variable.

We'll get a similar error if we attempt to evaluate the =etuple= by accessing its =ExpressionTuple.evaled_obj= property. However, after performing a simple manipulation that replaces the logic variable with a valid input to =at.add= (reificatoin), we are able to evaluate the =etuple= and obtain an Aesara Tensor result, as demonstrated by the following code:

#+begin_src python :session :results output :exports both
from unification import reify

new_add_pattern = reify(add_pattern, {x_lv: 1., y_lv: 1.})
pprint(new_add_pattern)
#+end_src

#+RESULTS:
: e(
:   e(
:     aesara.tensor.elemwise.Elemwise,
:     <aesara.scalar.basic.Add at 0x7fd9c9f1a440>,
:     <frozendict {}>),
:   1.0,
:   1.0)

#+begin_src python :session :results output :exports both
pprint(new_add_pattern.evaled_obj)
#+end_src

#+RESULTS:
: Elemwise{add,no_inplace}.0

Working with S-expressions is much like manipulating a subset of Python AST, so, when using =etuples=, one is--in effect-*meta programming* (e.g. by automating the production and evaluation of Aesara graphs using Python code). As a matter of fact, =etuples= could be recast as =ast.Expr= and =ast.Call= objects that, though the use of =eval=, could achieve the same results-albeit without the more convenient tuple-like structuring.

* Operators and their parameters

In etuplized-graph-print the =etuple= form of our matrix-multuplication graph =z_et= produced Aesaa operators

#+begin_src python :session :results output :exports both
pprint(z_et[0])
#+end_src

#+RESULTS:
: e(aesara.tensor.math.Dot)

