blog/20220212-symbolic-aesara.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-23 Tue 17:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rewriting Aesara graphs</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Rewriting Aesara graphs</h1>
<p>
This article is a port of <a target='_blank' rel='noopener noreferrer' class='external' href="https://twitter.com/BrandonTWillard">Brandon Willard'</a>s <a target='_blank' rel='noopener noreferrer' class='external' href="https://pymc-devs.github.io/symbolic-pymc/symbolic-pymc-tour.html">Tour of the Symbolic PyMC library</a>, and is a simplified version of the <a target='_blank' rel='noopener noreferrer' class='external' href="https://aesara.readthedocs.io/en/latest/extending/graph_rewriting.html#unification-and-reification">example in Aesara's documentation</a>. The text is almost a verbatim copy of the original, but mistakes are obviously mine.
</p>

<p>
In this document we will be implementing a symbolic "search-and-replace" that changes aesara graphs like <code>at.dot(A, x+y)</code> to <code>at.dot(A, x) + at.dot(A, y)</code>. In other words we will demonstrate how to implement the distributive property of the matrix multiplication so it can be applied to any aesara graph. Aesara allows one to implement rewrite rules like the distributive property&#x2014;and many other sophisticated manipulation of graphs&#x2014;by providing flexible, pure Python versions of core operations in symbolic computation. These operations are then combined and orchestrated through the relational programming DSL <a target='_blank' rel='noopener noreferrer' class='external' href="http://minikanren.org/">miniKanren</a>.
</p>

<p>
More specifically, we’ll introduce the basic unification and reification operations and explicitly show how they relate to graph manipulation and the modeling of high-level mathematical relations. Along the way, we’ll cover some of the necessary details behind Aesara graphs.
</p>

<p>
We start by creating a graph of our target expressions–i.e. <code>at.dot(A, x + y)</code> in Aesara. We need to do this in order to determine exactly what we’re searching for and–later–what to put in its place.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">A_tt</span> = at.matrix(<span style="font-style: italic;">"A"</span>)
<span style="font-weight: bold; font-style: italic;">x_tt</span> = at.vector(<span style="font-style: italic;">"x"</span>)
<span style="font-weight: bold; font-style: italic;">y_tt</span> = at.vector(<span style="font-style: italic;">"y"</span>)
<span style="font-weight: bold; font-style: italic;">z_tt</span> = at.dot(A_tt, x_tt + y_tt)
</pre>
</div>

<p>
We can get a text print-out of the graph using the debug print function <code>dprint</code>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara

aesara.dprint(z_tt)
</pre>
</div>

<pre class="example">
dot [id A] ''
 |A [id B]
 |Elemwise{add,no_inplace} [id C] ''
   |x [id D]
   |y [id E]
</pre>


<p>
The output of <code>dprint</code> shows the underlying operators (<code>dot</code>, <code>add</code>) and their arguments.
</p>

<p>
To "math/search for" combinations of Aesara operations&#x2013;or, as we just saw, graphs&#x2013;we use <b>unification</b>; to "replace" parts of the graph (well, produce a copy with replaced parts) we use <b>reificatoin</b>. Aesara provides support for these via <b>expression-tuples</b>.
</p>

<div id="outline-container-orga562bdb" class="outline-2">
<h2 id="orga562bdb">S-expressions</h2>
<div class="outline-text-2" id="text-orga562bdb">
<p>
We can convert an Aesara graphs into an <a target='_blank' rel='noopener noreferrer' class='external' href="https://en.wikipedia.org/wiki/S-expression">S-expression-like</a> form using <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/pythological/etuples">etuples</a>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> etuples <span style="font-weight: bold;">import</span> etuple, etuplize
<span style="font-weight: bold;">from</span> IPython.lib.pretty <span style="font-weight: bold;">import</span> pprint

<span style="font-weight: bold; font-style: italic;">z_et</span> = etuplize(z_tt)
pprint(z_et)
</pre>
</div>

<pre class="example" id="org446f188">
e(
  e(aesara.tensor.math.Dot),
  A,
  e(
    e(
      aesara.tensor.elemwise.Elemwise,
      &lt;aesara.scalar.basic.Add at 0x7fd9c9f1a440&gt;,
      &lt;frozendict {}&gt;),
    x,
    y))
</pre>

<p>
An <code>etuple</code> is like a normal <code>tuple</code>, except that its first element is a <code>Callable</code> and the remaining elements are the <code>Callable</code>'s arguments. As above, a pretty-printed <code>etuple</code> looks like a <code>tuple</code> prefixed by an <code>e</code>.
</p>

<p>
By working with <code>etuples</code> we can use <b>arbitrary Python functions</b> in conjunction with Aesara graphs and logic variable arguments. Basically, and <code>etuple</code> can be manipulated until all of its constituent logic variables are replaced with valid arguments to the function/operators. At that point the etuple can be evaluated.
</p>

<p>
For instance we can create an <code>etuple</code> that uses the function <code>at.add</code> with a logic variable argument.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> unification <span style="font-weight: bold;">import</span> var

<span style="font-weight: bold; font-style: italic;">x_lv</span>, <span style="font-weight: bold; font-style: italic;">y_lv</span> = var(<span style="font-style: italic;">'x'</span>), var(<span style="font-style: italic;">'y'</span>)
<span style="font-weight: bold; font-style: italic;">add_pattern</span> = etuple(etuplize(at.add), x_lv, y_lv)
</pre>
</div>

<p>
It wouldn't normally be possible to call the <code>at.add</code> function with these argument types, as demonstrated in this example:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">try</span>:
    at.add(x_lv, 1)
<span style="font-weight: bold;">except</span> <span style="font-weight: bold; text-decoration: underline;">NotImplementedError</span> <span style="font-weight: bold;">as</span> e:
    <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">str</span>(e))
</pre>
</div>

<pre class="example">
Cannot convert ~x to a tensor variable.
</pre>


<p>
We'll get a similar error if we attempt to evaluate the <code>etuple</code> by accessing its <code>ExpressionTuple.evaled_obj</code> property. However, after performing a simple manipulation that replaces the logic variable with a valid input to <code>at.add</code> (reificatoin), we are able to evaluate the <code>etuple</code> and obtain an Aesara Tensor result, as demonstrated by the following code:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> unification <span style="font-weight: bold;">import</span> reify

<span style="font-weight: bold; font-style: italic;">new_add_pattern</span> = reify(add_pattern, {x_lv: 1., y_lv: 1.})
pprint(new_add_pattern)
</pre>
</div>

<pre class="example">
e(
  e(
    aesara.tensor.elemwise.Elemwise,
    &lt;aesara.scalar.basic.Add at 0x7fd9c9f1a440&gt;,
    &lt;frozendict {}&gt;),
  1.0,
  1.0)
</pre>


<div class="org-src-container">
<pre class="src src-python">pprint(new_add_pattern.evaled_obj)
</pre>
</div>

<pre class="example">
Elemwise{add,no_inplace}.0
</pre>


<p>
Working with S-expressions is much like manipulating a subset of Python AST, so, when using <code>etuples</code>, one is&#x2013;in effect-<b>meta programming</b> (e.g. by automating the production and evaluation of Aesara graphs using Python code). As a matter of fact, <code>etuples</code> could be recast as <code>ast.Expr</code> and <code>ast.Call</code> objects that, though the use of <code>eval</code>, could achieve the same results-albeit without the more convenient tuple-like structuring.
</p>
</div>
</div>

<div id="outline-container-orga77244c" class="outline-2">
<h2 id="orga77244c">Operators and their parameters</h2>
<div class="outline-text-2" id="text-orga77244c">
<p>
In etuplized-graph-print the <code>etuple</code> form of our matrix-multuplication graph <code>z_et</code> produced Aesaa operators
</p>

<div class="org-src-container">
<pre class="src src-python">pprint(z_et[0])
</pre>
</div>

<pre class="example">
e(aesara.tensor.math.Dot)
</pre>
</div>
</div>
