org/blog/20220212-symbolic-aesara.org
* Unification and reification

With the ability to use logic variables and Aesara graphs together, we can now "search" or "match" arbitrary graphs using *unification* and produce new graphs by replacing logic variables using *reification*.

We start by making "patterns" or templates for the subgraphs we would like to match. Patterns, in this case, take the form of S-expressions with the desired structure and logic variables in place of "unknown" or arbitrary terms that we might like to reference elsewhere.

=dot_pattern= represents an S-expression that evaluateds to a graph in which two terms are matrix-multiplied.

#+begin_src python :session :exports code
from aesara.tensor.math import Dot

A_lv, B_lv = var("A"), var("B")
dot_pattern = etuple(etuple(Dot), A_lv, B_lv)
#+end_src

#+RESULTS:

"Matching" a graph against this pattern is called *unification*. Unificatoin of two graphs implies unification of all sub-graphs and elements between them. When unification is successful, it returns a map of logic variables and their unified values. If there are no logic variables in the graphs it simply returns an empty map. If unification fails, it returns =False=--at least in the implementation we use.

** Unification

We can perform unification using the function =unify=. The result is a =dict= mapping logic variables to their unified values.

#+begin_src python :session :results output :exports both
from unification import unify

s = unify(dot_pattern, z_et)
pprint(s)
#+end_src

#+RESULTS:
: {~A: A,
:  ~B: e(
:    e(
:      aesara.tensor.elemwise.Elemwise,
:      <aesara.scalar.basic.Add at 0x7fd9c9f1a440>,
:      <frozendict {}>),
:    x,
:    y)}

The logic variable =A= has been correctly unified with =A_tt=, while the logic variable =B= has been correctly unified with the addition of =x_tt= and =y_tt=.

** Reification

Using =reify= we can "fill-in"--or replace---the logic variables of our "pattern" with the matches obtained by =unify= that are held within the variable s, or we could specify our own substitutions based on that information.

In the following snipped we simply exchange the =A_tt= tensor with another =X_tt= tensor and create a new graph with that value. The end result is a version of the original graph =z_et=, with the new tensor.

#+begin_src python :session :results output :exports both
X_tt = at.matrix("X")
s[A_lv] = X_tt

z_et_re = reify(dot_pattern, s)
pprint(z_et_re)
#+end_src

#+RESULTS:
#+begin_example
e(
  e(aesara.tensor.math.Dot),
  X,
  e(
    e(
      aesara.tensor.elemwise.Elemwise,
      <aesara.scalar.basic.Add at 0x7fd9c9f1a440>,
      <frozendict {}>),
    x,
    y))
#+end_example

** Finishing our implementation

We can also reify an entirely different graph using the values extracted from the graph =z_et=. In this case, we create an "output" pattern graph, to complement our new "input" pattern graph =dot_pattern=. If we combine our dot product and addition =etuple= patterns, we can extract all the arguments needed as input to a distributed multiplication pattern.

#+begin_src python :session :results output :exports both
output_pattern = etuple(etuplize(at.add), etuple(etuple(Dot), A_lv, x_lv), etuple(etuple(Dot), B_lv, y_lv))
pprint(output_pattern)
#+end_src

#+RESULTS:
: e(
:   e(
:     aesara.tensor.elemwise.Elemwise,
:     <aesara.scalar.basic.Add at 0x7fd9c9f1a440>,
:     <frozendict {}>),
:   e(e(aesara.tensor.math.Dot), ~A, ~x),
:   e(e(aesara.tensor.math.Dot), ~B, ~y))

With logic variables =A_lv=, =x_lv= and =y_lv= mapped to their template-corresponding objects in another graph, we can reify =output_pattern=  and obtain a reified version of said graph.

Using the previous unification results contained in =s= we only need to reify =output_pattern= with those mappings. However, since our pattern refers to logic variables =x_lv= and =y_lv= we'll need to unify these logic variables with the appropriate terms in the graph.

#+begin_src python :session :results output :exports both
s_add = unify(s[B_lv], add_pattern, s)
pprint(s_add)
#+end_src

#+RESULTS:
#+begin_example
{~A: X,
 ~B: e(
   e(
     aesara.tensor.elemwise.Elemwise,
     <aesara.scalar.basic.Add at 0x7fd9c9f1a440>,
     <frozendict {}>),
   x,
   y),
 ~x: x,
 ~y: y}
#+end_example

#+begin_src python :session :results output :exports both
z_new = reify(output_pattern, s_add)
aesara.dprint(z_new.evaled_obj)
#+end_src

#+RESULTS:
#+begin_example
Elemwise{add,no_inplace} [id A] ''
 |dot [id B] ''
 | |X [id C]
 | |x [id D]
 |InplaceDimShuffle{x} [id E] ''
   |dot [id F] ''
     |Elemwise{add,no_inplace} [id G] ''
     | |x [id D]
     | |y [id H]
     |y [id H]
#+end_example

Using only the basics of unification and reification provided by Aesara one can extract specific elements from Aesara graphs and use them to implement mathematical identities/relations. Through clever use of multiple mathematical relations, one can--for example--construct graph *optimizations* that turn large classes of user-defined statistical models into computational tractable reformulations. Similarly, one can construct "normal forms" for models, making it possible to determine whether or not a user-defined model is suitable for a specific sampler.

Next we will introduce another major element of Aesara that orchestrates and simplifies sequences of unifications like we used earlier, provides control-flow-like capabilities, produces fully reified results of arbitrary forms and does so within a genuinely declarative formalism that carries much of the same power of logical programming: [[http://minikanren.org/][miniKanren]]!

* Relational programming in miniKanren

Aesara uses a Python implementation of the embedded domain-specific language miniKanren--provided by the =kanren= package--to orchestrate more sophisticated uses of unification and reification. For a quick intro, see [[https://github.com/pythological/kanren/blob/master/doc/basic.md][the basic introduction]] provided by the =kanren= package. We'll cover most of the same basic material here.

To start, miniKanren uses *goals* (in the same sense as [[https://en.wikipedia.org/wiki/Logic_programming][logic programming]]) to assert relations, and the =run= function evaluates those goals and allows one to specify the exact amount and type of reified output desired from the *states* that satisfy the goals.

In their most basic form, miniKanren *states* are simply the substitution maps returned by unification, which--in the normal course of operations--are not dealt with directly.

