blog/20220212-symbolic-aesara.html

<div id="outline-container-orgd414f83" class="outline-2">
<h2 id="orgd414f83">Unification and reification</h2>
<div class="outline-text-2" id="text-orgd414f83">
<p>
With the ability to use logic variables and Aesara graphs together, we can now "search" or "match" arbitrary graphs using <b>unification</b> and produce new graphs by replacing logic variables using <b>reification</b>.
</p>

<p>
We start by making "patterns" or templates for the subgraphs we would like to match. Patterns, in this case, take the form of S-expressions with the desired structure and logic variables in place of "unknown" or arbitrary terms that we might like to reference elsewhere.
</p>

<p>
<code>dot_pattern</code> represents an S-expression that evaluateds to a graph in which two terms are matrix-multiplied.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> aesara.tensor.math <span style="font-weight: bold;">import</span> Dot

<span style="font-weight: bold; font-style: italic;">A_lv</span>, <span style="font-weight: bold; font-style: italic;">B_lv</span> = var(<span style="font-style: italic;">"A"</span>), var(<span style="font-style: italic;">"B"</span>)
<span style="font-weight: bold; font-style: italic;">dot_pattern</span> = etuple(etuple(Dot), A_lv, B_lv)
</pre>
</div>

<p>
"Matching" a graph against this pattern is called <b>unification</b>. Unificatoin of two graphs implies unification of all sub-graphs and elements between them. When unification is successful, it returns a map of logic variables and their unified values. If there are no logic variables in the graphs it simply returns an empty map. If unification fails, it returns <code>False</code>&#x2013;at least in the implementation we use.
</p>
</div>

<div id="outline-container-orgcd219c7" class="outline-3">
<h3 id="orgcd219c7">Unification</h3>
<div class="outline-text-3" id="text-orgcd219c7">
<p>
We can perform unification using the function <code>unify</code>. The result is a <code>dict</code> mapping logic variables to their unified values.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> unification <span style="font-weight: bold;">import</span> unify

<span style="font-weight: bold; font-style: italic;">s</span> = unify(dot_pattern, z_et)
pprint(s)
</pre>
</div>

<pre class="example">
{~A: A,
 ~B: e(
   e(
     aesara.tensor.elemwise.Elemwise,
     &lt;aesara.scalar.basic.Add at 0x7fd9c9f1a440&gt;,
     &lt;frozendict {}&gt;),
   x,
   y)}
</pre>


<p>
The logic variable <code>A</code> has been correctly unified with <code>A_tt</code>, while the logic variable <code>B</code> has been correctly unified with the addition of <code>x_tt</code> and <code>y_tt</code>.
</p>
</div>
</div>

<div id="outline-container-org5c0507f" class="outline-3">
<h3 id="org5c0507f">Reification</h3>
<div class="outline-text-3" id="text-org5c0507f">
<p>
Using <code>reify</code> we can "fill-in"&#x2013;or replace&#x2014;the logic variables of our "pattern" with the matches obtained by <code>unify</code> that are held within the variable s, or we could specify our own substitutions based on that information.
</p>

<p>
In the following snipped we simply exchange the <code>A_tt</code> tensor with another <code>X_tt</code> tensor and create a new graph with that value. The end result is a version of the original graph <code>z_et</code>, with the new tensor.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">X_tt</span> = at.matrix(<span style="font-style: italic;">"X"</span>)
<span style="font-weight: bold; font-style: italic;">s</span>[A_lv] = X_tt

<span style="font-weight: bold; font-style: italic;">z_et_re</span> = reify(dot_pattern, s)
pprint(z_et_re)
</pre>
</div>

<pre class="example" id="org0e31bf7">
e(
  e(aesara.tensor.math.Dot),
  X,
  e(
    e(
      aesara.tensor.elemwise.Elemwise,
      &lt;aesara.scalar.basic.Add at 0x7fd9c9f1a440&gt;,
      &lt;frozendict {}&gt;),
    x,
    y))
</pre>
</div>
</div>

<div id="outline-container-org81d3a8f" class="outline-3">
<h3 id="org81d3a8f">Finishing our implementation</h3>
<div class="outline-text-3" id="text-org81d3a8f">
<p>
We can also reify an entirely different graph using the values extracted from the graph <code>z_et</code>. In this case, we create an "output" pattern graph, to complement our new "input" pattern graph <code>dot_pattern</code>. If we combine our dot product and addition <code>etuple</code> patterns, we can extract all the arguments needed as input to a distributed multiplication pattern.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">output_pattern</span> = etuple(etuplize(at.add), etuple(etuple(Dot), A_lv, x_lv), etuple(etuple(Dot), B_lv, y_lv))
pprint(output_pattern)
</pre>
</div>

<pre class="example">
e(
  e(
    aesara.tensor.elemwise.Elemwise,
    &lt;aesara.scalar.basic.Add at 0x7fd9c9f1a440&gt;,
    &lt;frozendict {}&gt;),
  e(e(aesara.tensor.math.Dot), ~A, ~x),
  e(e(aesara.tensor.math.Dot), ~B, ~y))
</pre>


<p>
With logic variables <code>A_lv</code>, <code>x_lv</code> and <code>y_lv</code> mapped to their template-corresponding objects in another graph, we can reify <code>output_pattern</code>  and obtain a reified version of said graph.
</p>

<p>
Using the previous unification results contained in <code>s</code> we only need to reify <code>output_pattern</code> with those mappings. However, since our pattern refers to logic variables <code>x_lv</code> and <code>y_lv</code> we'll need to unify these logic variables with the appropriate terms in the graph.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">s_add</span> = unify(s[B_lv], add_pattern, s)
pprint(s_add)
</pre>
</div>

<pre class="example" id="orgaaabf29">
{~A: X,
 ~B: e(
   e(
     aesara.tensor.elemwise.Elemwise,
     &lt;aesara.scalar.basic.Add at 0x7fd9c9f1a440&gt;,
     &lt;frozendict {}&gt;),
   x,
   y),
 ~x: x,
 ~y: y}
</pre>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">z_new</span> = reify(output_pattern, s_add)
aesara.dprint(z_new.evaled_obj)
</pre>
</div>

<pre class="example" id="orga5d932a">
Elemwise{add,no_inplace} [id A] ''
 |dot [id B] ''
 | |X [id C]
 | |x [id D]
 |InplaceDimShuffle{x} [id E] ''
   |dot [id F] ''
     |Elemwise{add,no_inplace} [id G] ''
     | |x [id D]
     | |y [id H]
     |y [id H]
</pre>

<p>
Using only the basics of unification and reification provided by Aesara one can extract specific elements from Aesara graphs and use them to implement mathematical identities/relations. Through clever use of multiple mathematical relations, one can&#x2013;for example&#x2013;construct graph <b>optimizations</b> that turn large classes of user-defined statistical models into computational tractable reformulations. Similarly, one can construct "normal forms" for models, making it possible to determine whether or not a user-defined model is suitable for a specific sampler.
</p>

<p>
Next we will introduce another major element of Aesara that orchestrates and simplifies sequences of unifications like we used earlier, provides control-flow-like capabilities, produces fully reified results of arbitrary forms and does so within a genuinely declarative formalism that carries much of the same power of logical programming: <a target='_blank' rel='noopener noreferrer' class='external' href="http://minikanren.org/">miniKanren</a>!
</p>
</div>
</div>
</div>

<div id="outline-container-org7c8472e" class="outline-2">
<h2 id="org7c8472e">Relational programming in miniKanren</h2>
<div class="outline-text-2" id="text-org7c8472e">
<p>
Aesara uses a Python implementation of the embedded domain-specific language miniKanren&#x2013;provided by the <code>kanren</code> package&#x2013;to orchestrate more sophisticated uses of unification and reification. For a quick intro, see <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/pythological/kanren/blob/master/doc/basic.md">the basic introduction</a> provided by the <code>kanren</code> package. We'll cover most of the same basic material here.
</p>

<p>
To start, miniKanren uses <b>goals</b> (in the same sense as <a target='_blank' rel='noopener noreferrer' class='external' href="https://en.wikipedia.org/wiki/Logic_programming">logic programming</a>) to assert relations, and the <code>run</code> function evaluates those goals and allows one to specify the exact amount and type of reified output desired from the <b>states</b> that satisfy the goals.
</p>

<p>
In their most basic form, miniKanren <b>states</b> are simply the substitution maps returned by unification, which&#x2013;in the normal course of operations&#x2013;are not dealt with directly.
</p>
</div>
