org/blog/20220212-symbolic-aesara.org
** The basic goals

Normally, a user will only need to construct compound goals from a basic set of primitives. Arguably, the most primitive goal is the [[https://en.wikipedia.org/wiki/Equivalence_relation][equivalence relation]] under unification denoted by =eq= in Python.

In the following code block we ask for all successful results/reifications (signified by the =0= argument) of the logic variable =var('q')= for the goal =eq(var('q'), 1)=, i.e. unify =var('q')= with =1=.

#+begin_src python :session :results output :exports both
from kanren import run, eq

q_lv = var('q')
mk_res = run(0, q_lv, eq(q_lv, 1))
pprint(mk_res)
#+end_src

#+RESULTS:
: (1,)

Since miniKanren's =run= always returns a stream of results, we obtain a tuple containing the reified values of =q_lv= under the one possible state for which our stated goal successfully evaluates.

The other basic primitives represent conjunction and disjunction of miniKanren goals: =lall= and =lany= respectively.

#+begin_src python :session :results output :export both
from kanren import lall

mk_res = run(0, q_lv, lall(eq(q_lv, 1), eq(q_lv, 2)))
pprint(mk_res)
#+end_src

#+RESULTS:
: ()

We just used =lall= to obtain the conjunction of two unificatoin goals. Since we requested the same logic variable be unified with =1= and =2= simultaneously, which is imposssibe, we got back an empty stream of results--indicating failure.

Goal disjunction, =lany=, will split a state stream accross goals, producing new distrinct states for each:

#+begin_src python :session :results output :export both
from kanren import lany

mk_res = run(0, q_lv, lany(eq(q_lv, 1), eq(q_lv, 2)))
pprint(mk_res)
#+end_src

#+RESULTS:
: (1, 2)

The goal disjunction result shows that the logic variable =q_lv= can be unified with either =1= or =2= under the two unification goals.

A common pattern of disjuntion and conjunction is called =conde=, and it mirrors the Lisp function =cond=, which is effectively a type compound =if ... elif ... elif ...=. Specifically, =conde([x_1, ...], ..., [y_1,...])= is the same as =lany(lall(x_1,...), ..., lall(y_1, ...))=-i.e. a disjunction of goal conjunctions.

#+begin_src python :session :results output :exports both
from kanren import conde

r_lv = var("r")

mk_res = run(
    0,
    [q_lv, r_lv],
    conde(
        [eq(q_lv, 1), eq(r_lv, 10)],
        [eq(q_lv, 2), eq(r_lv, 20)]
    )
)
pprint(mk_res)
#+end_src

#+RESULTS:
: ([1, 10], [2, 20])

We introduced another logic variable =r_lv= and requested the reified values of a list containing both logic variables. The output resembles the idea thatif =q_lv= is "equal" to =1=, then =r_lv= is "equal" to =10=, etc. Unlike normal conditionals, each clause/branch isn't exclusive, instead each is realized when the goals in a branch can be successful.

The following code demonstrated when =conde= can behave more like a traditional statement.

#+begin_src python :session :results output :exports both
mk_res = run(0, [q_lv, r_lv],
             lall(eq(q_lv, 1),
                  conde(
                      [eq(q_lv, 1), eq(r_lv, 10)],
                      [eq(q_lv, 2), eq(r_lv, 20)],
                  )))
pprint(mk_res)
#+end_src

#+RESULTS:
: ([1, 10],)

** A better implementation

Since miniKanren uses unification and reification, we can apply its basic goals to Aesara graphs, as we did earlier, and reproduce the entire implementation in a much more concise manner.

#+begin_src python :session :results output :exports both
mk_res = run(1, output_pattern, eq(dot_pattern, z_et), eq(add_pattern, B_lv))
pprint(mk_res)
#+end_src

#+RESULTS:
#+begin_example
(e(
   e(
     aesara.tensor.elemwise.Elemwise,
     <aesara.scalar.basic.Add at 0x7fd9c9f1a440>,
     <frozendict {}>),
   e(e(aesara.tensor.math.Dot), A, x),
   e(
     e(aesara.tensor.math.Dot),
     e(
       e(
         aesara.tensor.elemwise.Elemwise,
         <aesara.scalar.basic.Add at 0x7fd9c9f1a440>,
         <frozendict {}>),
       x,
       y),
     y)),)
#+end_example

We obtain an etuple that we can evaluate to get the graph

#+begin_src python :session :results output :exports both
aesara.dprint(mk_res[0].evaled_obj)
#+end_src

#+RESULTS:
#+begin_example
Elemwise{add,no_inplace} [id A] ''
 |dot [id B] ''
 | |A [id C]
 | |x [id D]
 |InplaceDimShuffle{x} [id E] ''
   |dot [id F] ''
     |Elemwise{add,no_inplace} [id G] ''
     | |x [id D]
     | |y [id H]
     |y [id H]
#+end_example

We did not need to use the conjunction operation =lall= explicitly, because all remaining goal arguments to =run= are automatically applied in conjunction.

Before moving on to the next section and goal construction, let us summarize everything we did in a self-contained exampe:

#+begin_src python :results output :exports both
import aesara
import aesara.tensor as at
from aesara.tensor.math import Dot

from etuples import etuple, etuplize
from kanren import eq, run
from unification import var

from IPython.lib.pretty import pprint

# Define the graph we want to "modify"
A_tt = at.matrix("A")
x_tt = at.vector("x")
y_tt = at.vector("y")
z_tt = at.dot(A_tt, x_tt + y_tt)

z_et = etuplize(z_tt)

# Input patterns and logic variables
x_lv, y_lv = var('x'), var('y')
add_pattern = etuple(etuplize(at.add), x_lv, y_lv)

A_lv, B_lv = var('A'), var('B')
dot_pattern = etuple(etuple(Dot), A_lv, B_lv)

# Output pattern
output_pattern = etuple(etuplize(at.add), etuple(etuple(Dot), A_lv, x_lv), etuple(etuple(Dot), B_lv, y_lv))

# Using miniKanren
mk_res = run(1, output_pattern, eq(dot_pattern, z_et), eq(add_pattern, B_lv))
aesara.dprint(mk_res[0].evaled_obj)
#+end_src

#+RESULTS:
#+begin_example
Elemwise{add,no_inplace} [id A] ''
 |dot [id B] ''
 | |A [id C]
 | |x [id D]
 |InplaceDimShuffle{x} [id E] ''
   |dot [id F] ''
     |Elemwise{add,no_inplace} [id G] ''
     | |x [id D]
     | |y [id H]
     |y [id H]
#+end_example

When combinations of miniKanren goals comprise logical units, we can wrap their construction in functions which we call *goal constructors*.

