blog/20220212-symbolic-aesara.html

<div id="outline-container-orga4e551c" class="outline-3">
<h3 id="orga4e551c">The basic goals</h3>
<div class="outline-text-3" id="text-orga4e551c">
<p>
Normally, a user will only need to construct compound goals from a basic set of primitives. Arguably, the most primitive goal is the <a target='_blank' rel='noopener noreferrer' class='external' href="https://en.wikipedia.org/wiki/Equivalence_relation">equivalence relation</a> under unification denoted by <code>eq</code> in Python.
</p>

<p>
In the following code block we ask for all successful results/reifications (signified by the <code>0</code> argument) of the logic variable <code>var('q')</code> for the goal <code>eq(var('q'), 1)</code>, i.e. unify <code>var('q')</code> with <code>1</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> run, eq

<span style="font-weight: bold; font-style: italic;">q_lv</span> = var(<span style="font-style: italic;">'q'</span>)
<span style="font-weight: bold; font-style: italic;">mk_res</span> = run(0, q_lv, eq(q_lv, 1))
pprint(mk_res)
</pre>
</div>

<pre class="example">
(1,)
</pre>


<p>
Since miniKanren's <code>run</code> always returns a stream of results, we obtain a tuple containing the reified values of <code>q_lv</code> under the one possible state for which our stated goal successfully evaluates.
</p>

<p>
The other basic primitives represent conjunction and disjunction of miniKanren goals: <code>lall</code> and <code>lany</code> respectively.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> lall

<span style="font-weight: bold; font-style: italic;">mk_res</span> = run(0, q_lv, lall(eq(q_lv, 1), eq(q_lv, 2)))
pprint(mk_res)
</pre>
</div>

<p>
We just used <code>lall</code> to obtain the conjunction of two unificatoin goals. Since we requested the same logic variable be unified with <code>1</code> and <code>2</code> simultaneously, which is imposssibe, we got back an empty stream of results&#x2013;indicating failure.
</p>

<p>
Goal disjunction, <code>lany</code>, will split a state stream accross goals, producing new distrinct states for each:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> lany

<span style="font-weight: bold; font-style: italic;">mk_res</span> = run(0, q_lv, lany(eq(q_lv, 1), eq(q_lv, 2)))
pprint(mk_res)
</pre>
</div>

<p>
The goal disjunction result shows that the logic variable <code>q_lv</code> can be unified with either <code>1</code> or <code>2</code> under the two unification goals.
</p>

<p>
A common pattern of disjuntion and conjunction is called <code>conde</code>, and it mirrors the Lisp function <code>cond</code>, which is effectively a type compound <code>if ... elif ... elif ...</code>. Specifically, <code>conde([x_1, ...], ..., [y_1,...])</code> is the same as <code>lany(lall(x_1,...), ..., lall(y_1, ...))</code>-i.e. a disjunction of goal conjunctions.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> conde

<span style="font-weight: bold; font-style: italic;">r_lv</span> = var(<span style="font-style: italic;">"r"</span>)

<span style="font-weight: bold; font-style: italic;">mk_res</span> = run(
    0,
    [q_lv, r_lv],
    conde(
        [eq(q_lv, 1), eq(r_lv, 10)],
        [eq(q_lv, 2), eq(r_lv, 20)]
    )
)
pprint(mk_res)
</pre>
</div>

<pre class="example">
([1, 10], [2, 20])
</pre>


<p>
We introduced another logic variable <code>r_lv</code> and requested the reified values of a list containing both logic variables. The output resembles the idea thatif <code>q_lv</code> is "equal" to <code>1</code>, then <code>r_lv</code> is "equal" to <code>10</code>, etc. Unlike normal conditionals, each clause/branch isn't exclusive, instead each is realized when the goals in a branch can be successful.
</p>

<p>
The following code demonstrated when <code>conde</code> can behave more like a traditional statement.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">mk_res</span> = run(0, [q_lv, r_lv],
             lall(eq(q_lv, 1),
                  conde(
                      [eq(q_lv, 1), eq(r_lv, 10)],
                      [eq(q_lv, 2), eq(r_lv, 20)],
                  )))
pprint(mk_res)
</pre>
</div>

<pre class="example">
([1, 10],)
</pre>
</div>
</div>

<div id="outline-container-org97442b6" class="outline-3">
<h3 id="org97442b6">A better implementation</h3>
<div class="outline-text-3" id="text-org97442b6">
<p>
Since miniKanren uses unification and reification, we can apply its basic goals to Aesara graphs, as we did earlier, and reproduce the entire implementation in a much more concise manner.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">mk_res</span> = run(1, output_pattern, eq(dot_pattern, z_et), eq(add_pattern, B_lv))
pprint(mk_res)
</pre>
</div>

<pre class="example" id="org51a13a4">
(e(
   e(
     aesara.tensor.elemwise.Elemwise,
     &lt;aesara.scalar.basic.Add at 0x7fd9c9f1a440&gt;,
     &lt;frozendict {}&gt;),
   e(e(aesara.tensor.math.Dot), A, x),
   e(
     e(aesara.tensor.math.Dot),
     e(
       e(
         aesara.tensor.elemwise.Elemwise,
         &lt;aesara.scalar.basic.Add at 0x7fd9c9f1a440&gt;,
         &lt;frozendict {}&gt;),
       x,
       y),
     y)),)
</pre>

<p>
We obtain an etuple that we can evaluate to get the graph
</p>

<div class="org-src-container">
<pre class="src src-python">aesara.dprint(mk_res[0].evaled_obj)
</pre>
</div>

<pre class="example" id="org51dcb5d">
Elemwise{add,no_inplace} [id A] ''
 |dot [id B] ''
 | |A [id C]
 | |x [id D]
 |InplaceDimShuffle{x} [id E] ''
   |dot [id F] ''
     |Elemwise{add,no_inplace} [id G] ''
     | |x [id D]
     | |y [id H]
     |y [id H]
</pre>

<p>
We did not need to use the conjunction operation <code>lall</code> explicitly, because all remaining goal arguments to <code>run</code> are automatically applied in conjunction.
</p>

<p>
Before moving on to the next section and goal construction, let us summarize everything we did in a self-contained exampe:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara
<span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at
<span style="font-weight: bold;">from</span> aesara.tensor.math <span style="font-weight: bold;">import</span> Dot

<span style="font-weight: bold;">from</span> etuples <span style="font-weight: bold;">import</span> etuple, etuplize
<span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> eq, run
<span style="font-weight: bold;">from</span> unification <span style="font-weight: bold;">import</span> var

<span style="font-weight: bold;">from</span> IPython.lib.pretty <span style="font-weight: bold;">import</span> pprint

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Define the graph we want to "modify"</span>
<span style="font-weight: bold; font-style: italic;">A_tt</span> = at.matrix(<span style="font-style: italic;">"A"</span>)
<span style="font-weight: bold; font-style: italic;">x_tt</span> = at.vector(<span style="font-style: italic;">"x"</span>)
<span style="font-weight: bold; font-style: italic;">y_tt</span> = at.vector(<span style="font-style: italic;">"y"</span>)
<span style="font-weight: bold; font-style: italic;">z_tt</span> = at.dot(A_tt, x_tt + y_tt)

<span style="font-weight: bold; font-style: italic;">z_et</span> = etuplize(z_tt)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Input patterns and logic variables</span>
<span style="font-weight: bold; font-style: italic;">x_lv</span>, <span style="font-weight: bold; font-style: italic;">y_lv</span> = var(<span style="font-style: italic;">'x'</span>), var(<span style="font-style: italic;">'y'</span>)
<span style="font-weight: bold; font-style: italic;">add_pattern</span> = etuple(etuplize(at.add), x_lv, y_lv)

<span style="font-weight: bold; font-style: italic;">A_lv</span>, <span style="font-weight: bold; font-style: italic;">B_lv</span> = var(<span style="font-style: italic;">'A'</span>), var(<span style="font-style: italic;">'B'</span>)
<span style="font-weight: bold; font-style: italic;">dot_pattern</span> = etuple(etuple(Dot), A_lv, B_lv)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Output pattern</span>
<span style="font-weight: bold; font-style: italic;">output_pattern</span> = etuple(etuplize(at.add), etuple(etuple(Dot), A_lv, x_lv), etuple(etuple(Dot), B_lv, y_lv))

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Using miniKanren</span>
<span style="font-weight: bold; font-style: italic;">mk_res</span> = run(1, output_pattern, eq(dot_pattern, z_et), eq(add_pattern, B_lv))
aesara.dprint(mk_res[0].evaled_obj)
</pre>
</div>

<pre class="example" id="orgd2c22cd">
Elemwise{add,no_inplace} [id A] ''
 |dot [id B] ''
 | |A [id C]
 | |x [id D]
 |InplaceDimShuffle{x} [id E] ''
   |dot [id F] ''
     |Elemwise{add,no_inplace} [id G] ''
     | |x [id D]
     | |y [id H]
     |y [id H]
</pre>

<p>
When combinations of miniKanren goals comprise logical units, we can wrap their construction in functions which we call <b>goal constructors</b>.
</p>
</div>
</div>
