org/blog/20220212-symbolic-aesara.org
** Goals Constructors

Using our distributive law example, we can create a goal constructor that creates our combined pattern and applies it in one go.

#+begin_src python :session :results output :exports both
def distributeo(in_g, out_g):
    """Create a oal that represents commuted matrix multiplicatoin and addition."""
    A_lv, x_lv, y_lv = var(), var(), var()
    dot_pattern = etuple(etuple(Dot), A_lv, etuple(etuplize(at.add), x_lv, y_lv))
    dist_pattern = etuple(etuplize(at.add), etuple(etuple(Dot), A_lv, x_lv), etuple(etuple(Dot), A_lv, y_lv))

    return lall(eq(in_g, dot_pattern), eq(out_g, dist_pattern))
#+end_src

#+RESULTS:

Our goal constructor represent the *relation* for distribution of matrix multiplication and addition. In this sense, it can be run *both* ways i.e. it can "expand" a multiplication by distributing it through addition, and it can "contract" it by doing the opposite.

In the following example we "expand" the multiplication:

#+begin_src python :session :results output :exports both
q_lv = var()
mk_res = run(1, q_lv, distributeo(z_et, q_lv))
z_expanded_et = mk_res[0].evaled_obj
aesara.dprint(z_expanded_et)
#+end_src

#+RESULTS:
: Elemwise{add,no_inplace} [id A] ''
:  |dot [id B] ''
:  | |A [id C]
:  | |x [id D]
:  |dot [id E] ''
:    |A [id C]
:    |y [id F]

And in the following example we "contract" the previously expanded result

#+begin_src python :session :results output :exports both
q_lv = var()
mk_res = run(1, q_lv, distributeo(q_lv, z_expanded_et))
z_contracted_et = mk_res[0].evaled_obj
aesara.dprint(z_contracted_et)
#+end_src

#+RESULTS:
: dot [id A] ''
:  |A [id B]
:  |Elemwise{add,no_inplace} [id C] ''
:    |x [id D]
:    |y [id E]

** Graph-based goals

In most situation the desired graphs will be subgraphs of much larger ones. Aesara introduces some miniKanren goals that apply other goals throughout graphs until a fixed-point is reached. This sequence of operations is generally necessary for graph simplification and rewriting.

In the following example we create a new graph that contains =at.dot(A, x+y)= as a subgraph.

#+begin_src python :session :results output :exports results
z_graph_tt = 2 * at.dot(A_tt, x_tt + y_tt) + 1.
z_graph_et = etuplize(z_graph_tt)
pprint(z_graph_et)
#+end_src

#+RESULTS:
#+begin_example
e(
  e(
    aesara.tensor.elemwise.Elemwise,
    <aesara.scalar.basic.Add at 0x7fd9c9f1a440>,
    <frozendict {}>),
  e(
    e(
      aesara.tensor.elemwise.Elemwise,
      <aesara.scalar.basic.Mul at 0x7fd9c9f1a560>,
      <frozendict {}>),
    e(
      e(aesara.tensor.elemwise.DimShuffle, (), ('x',), True),
      TensorConstant{2}),
    e(
      e(aesara.tensor.math.Dot),
      A,
      e(
        e(
          aesara.tensor.elemwise.Elemwise,
          <aesara.scalar.basic.Add at 0x7fd9c9f1a440>,
          <frozendict {}>),
        x,
        y))),
  e(
    e(aesara.tensor.elemwise.DimShuffle, (), ('x',), True),
    TensorConstant{1.0}))
#+end_example

We define =graph_walko=, a function that walks term graphs and will apply our =distributeo= goal throughout the graph until the applicable subgraph is found (and replaced)

#+begin_src python :session :results output :exports both
from etuples.core import ExpressionTuple
from kanren.graph import walko
from kanren import eq
from functools import partial

graph_walko = partial(walko, rator_goal=eq)

q_lv = var()
mk_res = run(1, q_lv, graph_walko(distributeo, z_graph_et, q_lv))
aesara.dprint(mk_res[0].evaled_obj)
#+end_src

#+RESULTS:
#+begin_example
Elemwise{add,no_inplace} [id A] ''
 |Elemwise{mul,no_inplace} [id B] ''
 | |InplaceDimShuffle{x} [id C] ''
 | | |TensorConstant{2} [id D]
 | |Elemwise{add,no_inplace} [id E] ''
 |   |dot [id F] ''
 |   | |A [id G]
 |   | |x [id H]
 |   |dot [id I] ''
 |     |A [id G]
 |     |y [id J]
 |InplaceDimShuffle{x} [id K] ''
   |TensorConstant{1.0} [id L]
#+end_example
