blog/20220212-symbolic-aesara.html

<div id="outline-container-orga966ce2" class="outline-3">
<h3 id="orga966ce2">Goals Constructors</h3>
<div class="outline-text-3" id="text-orga966ce2">
<p>
Using our distributive law example, we can create a goal constructor that creates our combined pattern and applies it in one go.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">distributeo</span>(in_g, out_g):
    <span style="font-style: italic;">"""Create a oal that represents commuted matrix multiplicatoin and addition."""</span>
    <span style="font-weight: bold; font-style: italic;">A_lv</span>, <span style="font-weight: bold; font-style: italic;">x_lv</span>, <span style="font-weight: bold; font-style: italic;">y_lv</span> = var(), var(), var()
    <span style="font-weight: bold; font-style: italic;">dot_pattern</span> = etuple(etuple(Dot), A_lv, etuple(etuplize(at.add), x_lv, y_lv))
    <span style="font-weight: bold; font-style: italic;">dist_pattern</span> = etuple(etuplize(at.add), etuple(etuple(Dot), A_lv, x_lv), etuple(etuple(Dot), A_lv, y_lv))

    <span style="font-weight: bold;">return</span> lall(eq(in_g, dot_pattern), eq(out_g, dist_pattern))
</pre>
</div>

<p>
Our goal constructor represent the <b>relation</b> for distribution of matrix multiplication and addition. In this sense, it can be run <b>both</b> ways i.e. it can "expand" a multiplication by distributing it through addition, and it can "contract" it by doing the opposite.
</p>

<p>
In the following example we "expand" the multiplication:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">q_lv</span> = var()
<span style="font-weight: bold; font-style: italic;">mk_res</span> = run(1, q_lv, distributeo(z_et, q_lv))
<span style="font-weight: bold; font-style: italic;">z_expanded_et</span> = mk_res[0].evaled_obj
aesara.dprint(z_expanded_et)
</pre>
</div>

<pre class="example">
Elemwise{add,no_inplace} [id A] ''
 |dot [id B] ''
 | |A [id C]
 | |x [id D]
 |dot [id E] ''
   |A [id C]
   |y [id F]
</pre>


<p>
And in the following example we "contract" the previously expanded result
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">q_lv</span> = var()
<span style="font-weight: bold; font-style: italic;">mk_res</span> = run(1, q_lv, distributeo(q_lv, z_expanded_et))
<span style="font-weight: bold; font-style: italic;">z_contracted_et</span> = mk_res[0].evaled_obj
aesara.dprint(z_contracted_et)
</pre>
</div>

<pre class="example">
dot [id A] ''
 |A [id B]
 |Elemwise{add,no_inplace} [id C] ''
   |x [id D]
   |y [id E]
</pre>
</div>
</div>

<div id="outline-container-org3fdf7a2" class="outline-3">
<h3 id="org3fdf7a2">Graph-based goals</h3>
<div class="outline-text-3" id="text-org3fdf7a2">
<p>
In most situation the desired graphs will be subgraphs of much larger ones. Aesara introduces some miniKanren goals that apply other goals throughout graphs until a fixed-point is reached. This sequence of operations is generally necessary for graph simplification and rewriting.
</p>

<p>
In the following example we create a new graph that contains <code>at.dot(A, x+y)</code> as a subgraph.
</p>

<pre class="example" id="org3649a6e">
e(
  e(
    aesara.tensor.elemwise.Elemwise,
    &lt;aesara.scalar.basic.Add at 0x7fd9c9f1a440&gt;,
    &lt;frozendict {}&gt;),
  e(
    e(
      aesara.tensor.elemwise.Elemwise,
      &lt;aesara.scalar.basic.Mul at 0x7fd9c9f1a560&gt;,
      &lt;frozendict {}&gt;),
    e(
      e(aesara.tensor.elemwise.DimShuffle, (), ('x',), True),
      TensorConstant{2}),
    e(
      e(aesara.tensor.math.Dot),
      A,
      e(
        e(
          aesara.tensor.elemwise.Elemwise,
          &lt;aesara.scalar.basic.Add at 0x7fd9c9f1a440&gt;,
          &lt;frozendict {}&gt;),
        x,
        y))),
  e(
    e(aesara.tensor.elemwise.DimShuffle, (), ('x',), True),
    TensorConstant{1.0}))
</pre>

<p>
We define <code>graph_walko</code>, a function that walks term graphs and will apply our <code>distributeo</code> goal throughout the graph until the applicable subgraph is found (and replaced)
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> etuples.core <span style="font-weight: bold;">import</span> ExpressionTuple
<span style="font-weight: bold;">from</span> kanren.graph <span style="font-weight: bold;">import</span> walko
<span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> eq
<span style="font-weight: bold;">from</span> functools <span style="font-weight: bold;">import</span> partial

<span style="font-weight: bold; font-style: italic;">graph_walko</span> = partial(walko, rator_goal=eq)

<span style="font-weight: bold; font-style: italic;">q_lv</span> = var()
<span style="font-weight: bold; font-style: italic;">mk_res</span> = run(1, q_lv, graph_walko(distributeo, z_graph_et, q_lv))
aesara.dprint(mk_res[0].evaled_obj)
</pre>
</div>

<pre class="example" id="orgf7ee0e9">
Elemwise{add,no_inplace} [id A] ''
 |Elemwise{mul,no_inplace} [id B] ''
 | |InplaceDimShuffle{x} [id C] ''
 | | |TensorConstant{2} [id D]
 | |Elemwise{add,no_inplace} [id E] ''
 |   |dot [id F] ''
 |   | |A [id G]
 |   | |x [id H]
 |   |dot [id I] ''
 |     |A [id G]
 |     |y [id J]
 |InplaceDimShuffle{x} [id K] ''
   |TensorConstant{1.0} [id L]
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-04-12 Tue 00:00</p>
<p class="author">Author: Rémi Louf</p>
<p class="email">Email: <a href="mailto:remi@thetypicalset.com">remi@thetypicalset.com</a></p>
<p class="date">Created: 2022-08-23 Tue 17:18</p>
</div>
</body>
</html>
